In [2]:
#making data frame from dictionary
import pandas as pd
data={"country":["india","uk","austria","us"],"GDP":[123,345,678,2134]} 
print(data)
df=pd.DataFrame(data)
df #dicts keys are columns and 0,1,2,3 are indices of data frame

{'country': ['india', 'uk', 'austria', 'us'], 'GDP': [123, 345, 678, 2134]}

   country   GDP
0    india   123
1       uk   345
2  austria   678
3       us  2134

In [3]:
#to add missing values explicitly using np.nan(numpy)
import numpy as np
data={"country":["india","uk","austria","us",np.nan],"GDP":[123,345,678,np.nan,2134]} 
df=pd.DataFrame(data)
df

   country     GDP
0    india   123.0
1       uk   345.0
2  austria   678.0
3       us     NaN
4      NaN  2134.0

In [4]:
d={"name":["piya","riya","asshi","meera"],"age":['20','30','60','23'],\
   "height":[120.3,152.4,155,162],"gender":["f","f","m","f"]}  ## \ is used to break the lines
df=pd.DataFrame(d)
df

    name age  height gender
0   piya  20   120.3      f
1   riya  30   152.4      f
2  asshi  60   155.0      m
3  meera  23   162.0      f

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   age     4 non-null      object
 2   height  4 non-null      float64
 3   gender  4 non-null      object
dtypes: float64(1), object(3)
memory usage: 256.0+ bytes

In [6]:
#task1: take a string from the user, input: madrid, output: d={0:m,1:a,...}
s=input("enter a string:")
d={}
key=0
for i in s:
    d[key]=i
    key+=1
print(d)

enter a string:dragons
{0: 'd', 1: 'r', 2: 'a', 3: 'g', 4: 'o', 5: 'n', 6: 's'}

In [7]:
#task2: output: d={ascii of m:m,ascii of a:a,...} [ord(m)]
s=input("enter a string:")
d={}
#key=0
for i in s:
    key=i
    asc=ord(key)
    d[asc]=i
    #key+=1
print(d) #keys can't be repeated, so not last d

enter a string:flies
{102: 'f', 108: 'l', 105: 'i', 101: 'e', 115: 's'}

In [9]:
#task3: take student data from user in a dict (no. of keys depends on user) the convert to data frame
col=int(input("enter the number of columns:"))
d={}
for i in range(0,col):
    k=input("enter the key:")
    l=input("enter the details:").split()
    d[k]=l
print(d)
student=pd.DataFrame(d)
student

enter the number of columns:2
enter the key:roll_no
enter the details:101 102 103
enter the key:name
enter the details:
  @media print {
    .ms-editor-squiggles-container {
      display:none !important;
    }
  }
  .ms-editor-squiggles-container {
    all: initial;
  }Samuel madison robert
{'roll_no': ['101', '102', '103'], 'name': ['Samuel', 'madison', 'robert']}

  roll_no     name
0     101   Samuel
1     102  madison
2     103   robert

In [10]:
#checking the column types (before analysing) : df.dtypes
df.dtypes #any textual data (string) is a object in data frame

name       object
age        object
height    float64
gender     object
dtype: object

In [12]:
#here have to change data type of age to get its mean (as in string): astype(int)
df["age"]=df["age"].astype(int)
df.dtypes

name       object
age         int32
height    float64
gender     object
dtype: object

In [13]:
#to check type of specific col: df["col name"].dtype
df["age"].dtype

dtype('int32')

In [14]:
#df.info(): total cols, types of col, memory usage
df.info()
#earlier took 256 bytes when age was an object, now as int total memory is 240 bytes

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   age     4 non-null      int32
 2   height  4 non-null      float64
 3   gender  4 non-null      object
dtypes: float64(1), int32(1), object(2)
memory usage: 240.0+ bytes

In [15]:
#create the data frame form list
l1=[1,2,3,4]
df1=pd.DataFrame(l1)
print(df1)
print(type(df1))
print(df1.index)
#df.columns (for col names)
print(df1.columns)
#create a data frame with index and col
l2=[[1,2,3],[4,5,6]]
df2=pd.DataFrame(l2,index=["a","b"],columns=["x","y","z"])
df2

   0
0  1
1  2
2  3
3  4
<class 'pandas.core.frame.DataFrame'>
RangeIndex(start=0, stop=4, step=1)
RangeIndex(start=0, stop=1, step=1)

   x  y  z
a  1  2  3
b  4  5  6

In [16]:
#iloc[]: integer based indexing
#df[1] #inside bracket treated as row
print(df.iloc[1])
print(df.iloc[-1]) #series
#slice, to get alternate rows
df.iloc[0:5:2] #dataframe

name       riya
age          30
height    152.4
gender        f
Name: 1, dtype: object
name      meera
age          23
height    162.0
gender        f
Name: 3, dtype: object

    name  age  height gender
0   piya   20   120.3      f
2  asshi   60   155.0      m